###############################################################
#  Generated by:      Cadence Innovus 21.18-s099_1
#  OS:                Linux x86_64(Host ID c2slab.cet.ac.in)
#  Generated on:      Tue Mar  4 18:12:23 2025
#  Design:            fifo_top
#  Command:           saveDesign Placement/fifo_top.enc
###############################################################
current_design fifo_top
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {wr_clk_pad}]  -name write_clk -period 15.000000 -waveform {0.000000 7.000000}
set_clock_transition  -rise -min 1.875 [get_clocks {write_clk}]
set_clock_transition  -rise -max 3 [get_clocks {write_clk}]
set_clock_transition  -fall -min 1.875 [get_clocks {write_clk}]
set_clock_transition  -fall -max 3 [get_clocks {write_clk}]
create_clock  -name rd_vir_clk_i -period 30.000000 -waveform {0.000000 15.000000}
create_clock [get_ports {rd_clk_pad}]  -name read_clk -period 30.000000 -waveform {0.000000 15.000000}
set_clock_transition  -rise -min 3.75 [get_clocks {read_clk}]
set_clock_transition  -rise -max 6 [get_clocks {read_clk}]
set_clock_transition  -fall -min 3.75 [get_clocks {read_clk}]
set_clock_transition  -fall -max 6 [get_clocks {read_clk}]
create_clock  -name wr_vir_clk_i -period 15.000000 -waveform {0.000000 7.500000}
set_input_transition -min 1  [get_ports {wr_en_pad}]
set_input_transition -max 2.5  [get_ports {wr_en_pad}]
set_input_transition -min 1  [get_ports {rd_en_pad}]
set_input_transition -max 2.5  [get_ports {rd_en_pad}]
set_input_transition -min 1  [get_ports {wr_rst_pad}]
set_input_transition -max 2.5  [get_ports {wr_rst_pad}]
set_input_transition -min 1  [get_ports {rd_rst_pad}]
set_input_transition -max 2.5  [get_ports {rd_rst_pad}]
set_input_transition -min 1  [get_ports {wr_data_pad[7]}]
set_input_transition -max 2.5  [get_ports {wr_data_pad[7]}]
set_input_transition -min 1  [get_ports {wr_data_pad[6]}]
set_input_transition -max 2.5  [get_ports {wr_data_pad[6]}]
set_input_transition -min 1  [get_ports {wr_data_pad[5]}]
set_input_transition -max 2.5  [get_ports {wr_data_pad[5]}]
set_input_transition -min 1  [get_ports {wr_data_pad[4]}]
set_input_transition -max 2.5  [get_ports {wr_data_pad[4]}]
set_input_transition -min 1  [get_ports {wr_data_pad[3]}]
set_input_transition -max 2.5  [get_ports {wr_data_pad[3]}]
set_input_transition -min 1  [get_ports {wr_data_pad[2]}]
set_input_transition -max 2.5  [get_ports {wr_data_pad[2]}]
set_input_transition -min 1  [get_ports {wr_data_pad[1]}]
set_input_transition -max 2.5  [get_ports {wr_data_pad[1]}]
set_input_transition -min 1  [get_ports {wr_data_pad[0]}]
set_input_transition -max 2.5  [get_ports {wr_data_pad[0]}]
set_load -pin_load -max  5  [get_ports {rd_data_pad[7]}]
set_load -pin_load -min  5  [get_ports {rd_data_pad[7]}]
set_load -pin_load -max  5  [get_ports {rd_data_pad[6]}]
set_load -pin_load -min  5  [get_ports {rd_data_pad[6]}]
set_load -pin_load -max  5  [get_ports {rd_data_pad[5]}]
set_load -pin_load -min  5  [get_ports {rd_data_pad[5]}]
set_load -pin_load -max  5  [get_ports {rd_data_pad[4]}]
set_load -pin_load -min  5  [get_ports {rd_data_pad[4]}]
set_load -pin_load -max  5  [get_ports {rd_data_pad[3]}]
set_load -pin_load -min  5  [get_ports {rd_data_pad[3]}]
set_load -pin_load -max  5  [get_ports {rd_data_pad[2]}]
set_load -pin_load -min  5  [get_ports {rd_data_pad[2]}]
set_load -pin_load -max  5  [get_ports {rd_data_pad[1]}]
set_load -pin_load -min  5  [get_ports {rd_data_pad[1]}]
set_load -pin_load -max  5  [get_ports {rd_data_pad[0]}]
set_load -pin_load -min  5  [get_ports {rd_data_pad[0]}]
set_load -pin_load -max  5  [get_ports {empty_pad}]
set_load -pin_load -min  5  [get_ports {empty_pad}]
set_load -pin_load -max  5  [get_ports {full_pad}]
set_load -pin_load -min  5  [get_ports {full_pad}]
set_wire_load_mode enclosed
set_input_delay -add_delay 2.25 -min -clock [get_clocks {wr_vir_clk_i}] [get_ports {wr_data_pad[6]}]
set_input_delay -add_delay 7.75 -max -clock [get_clocks {wr_vir_clk_i}] [get_ports {wr_data_pad[6]}]
set_input_delay -add_delay 2.25 -min -clock [get_clocks {wr_vir_clk_i}] [get_ports {wr_en_pad}]
set_input_delay -add_delay 7.75 -max -clock [get_clocks {wr_vir_clk_i}] [get_ports {wr_en_pad}]
set_input_delay -add_delay 2.25 -min -clock [get_clocks {wr_vir_clk_i}] [get_ports {wr_data_pad[4]}]
set_input_delay -add_delay 7.75 -max -clock [get_clocks {wr_vir_clk_i}] [get_ports {wr_data_pad[4]}]
set_input_delay -add_delay 2.25 -min -clock [get_clocks {wr_vir_clk_i}] [get_ports {wr_data_pad[2]}]
set_input_delay -add_delay 7.75 -max -clock [get_clocks {wr_vir_clk_i}] [get_ports {wr_data_pad[2]}]
set_input_delay -add_delay 2.25 -min -clock [get_clocks {wr_vir_clk_i}] [get_ports {wr_data_pad[0]}]
set_input_delay -add_delay 7.75 -max -clock [get_clocks {wr_vir_clk_i}] [get_ports {wr_data_pad[0]}]
set_input_delay -add_delay 2.25 -min -clock [get_clocks {rd_vir_clk_i}] [get_ports {rd_en_pad}]
set_input_delay -add_delay 7.75 -max -clock [get_clocks {rd_vir_clk_i}] [get_ports {rd_en_pad}]
set_input_delay -add_delay 2.25 -min -clock [get_clocks {wr_vir_clk_i}] [get_ports {wr_data_pad[7]}]
set_input_delay -add_delay 7.75 -max -clock [get_clocks {wr_vir_clk_i}] [get_ports {wr_data_pad[7]}]
set_input_delay -add_delay 2.25 -min -clock [get_clocks {wr_vir_clk_i}] [get_ports {wr_data_pad[5]}]
set_input_delay -add_delay 7.75 -max -clock [get_clocks {wr_vir_clk_i}] [get_ports {wr_data_pad[5]}]
set_input_delay -add_delay 2.25 -min -clock [get_clocks {wr_vir_clk_i}] [get_ports {wr_data_pad[3]}]
set_input_delay -add_delay 7.75 -max -clock [get_clocks {wr_vir_clk_i}] [get_ports {wr_data_pad[3]}]
set_input_delay -add_delay 2.25 -min -clock [get_clocks {wr_vir_clk_i}] [get_ports {wr_data_pad[1]}]
set_input_delay -add_delay 7.75 -max -clock [get_clocks {wr_vir_clk_i}] [get_ports {wr_data_pad[1]}]
set_output_delay -add_delay 2.628 -min -clock [get_clocks {rd_vir_clk_i}] [get_ports {rd_data_pad[7]}]
set_output_delay -add_delay 3.931 -max -clock [get_clocks {rd_vir_clk_i}] [get_ports {rd_data_pad[7]}]
set_output_delay -add_delay 2.628 -min -clock [get_clocks {rd_vir_clk_i}] [get_ports {rd_data_pad[5]}]
set_output_delay -add_delay 3.931 -max -clock [get_clocks {rd_vir_clk_i}] [get_ports {rd_data_pad[5]}]
set_output_delay -add_delay 2.628 -min -clock [get_clocks {rd_vir_clk_i}] [get_ports {rd_data_pad[3]}]
set_output_delay -add_delay 3.931 -max -clock [get_clocks {rd_vir_clk_i}] [get_ports {rd_data_pad[3]}]
set_output_delay -add_delay 2.628 -min -clock [get_clocks {rd_vir_clk_i}] [get_ports {rd_data_pad[1]}]
set_output_delay -add_delay 3.931 -max -clock [get_clocks {rd_vir_clk_i}] [get_ports {rd_data_pad[1]}]
set_output_delay -add_delay 2.628 -min -clock [get_clocks {rd_vir_clk_i}] [get_ports {empty_pad}]
set_output_delay -add_delay 3.931 -max -clock [get_clocks {rd_vir_clk_i}] [get_ports {empty_pad}]
set_output_delay -add_delay 2.628 -min -clock [get_clocks {rd_vir_clk_i}] [get_ports {rd_data_pad[6]}]
set_output_delay -add_delay 3.931 -max -clock [get_clocks {rd_vir_clk_i}] [get_ports {rd_data_pad[6]}]
set_output_delay -add_delay 2.628 -min -clock [get_clocks {rd_vir_clk_i}] [get_ports {rd_data_pad[4]}]
set_output_delay -add_delay 3.931 -max -clock [get_clocks {rd_vir_clk_i}] [get_ports {rd_data_pad[4]}]
set_output_delay -add_delay 2.628 -min -clock [get_clocks {rd_vir_clk_i}] [get_ports {rd_data_pad[2]}]
set_output_delay -add_delay 3.931 -max -clock [get_clocks {rd_vir_clk_i}] [get_ports {rd_data_pad[2]}]
set_output_delay -add_delay 2.628 -min -clock [get_clocks {rd_vir_clk_i}] [get_ports {rd_data_pad[0]}]
set_output_delay -add_delay 3.931 -max -clock [get_clocks {rd_vir_clk_i}] [get_ports {rd_data_pad[0]}]
set_output_delay -add_delay 2.628 -min -clock [get_clocks {rd_vir_clk_i}] [get_ports {full_pad}]
set_output_delay -add_delay 3.931 -max -clock [get_clocks {rd_vir_clk_i}] [get_ports {full_pad}]
set_clock_uncertainty 0.375 [get_clocks {write_clk}]
set_clock_uncertainty 0.75 [get_clocks {read_clk}]
set __coll_3 [get_pins {{wr_addr_sync/dff_1/rd_data_reg[0]/CDN} {wr_addr_sync/dff_1/rd_data_reg[0]/D} f/full_r_reg/CDN f/full_r_reg/D {f/wr_addr_bin_r_reg[0]/CDN} {f/wr_addr_bin_r_reg[0]/D} {f/wr_addr_bin_r_reg[1]/CDN} {f/wr_addr_bin_r_reg[1]/D} {f/wr_addr_bin_r_reg[2]/CDN} {f/wr_addr_bin_r_reg[2]/D} {f/wr_addr_bin_r_reg[4]/CDN} {f/wr_addr_bin_r_reg[4]/D} {f/wr_addr_bin_r_reg[3]/CDN} {f/wr_addr_bin_r_reg[3]/D} e/empty_r_reg/D e/empty_r_reg/SDN {e/rd_addr_bin_r_reg[0]/CDN} {e/rd_addr_bin_r_reg[0]/D} {e/rd_addr_bin_r_reg[1]/CDN} {e/rd_addr_bin_r_reg[1]/D} {e/rd_addr_bin_r_reg[2]/CDN} {e/rd_addr_bin_r_reg[2]/D} {e/rd_addr_bin_r_reg[3]/CDN} {e/rd_addr_bin_r_reg[3]/D} {m/mem_reg[0][0]/CDN} {m/mem_reg[0][0]/D} {m/mem_reg[0][0]/ENN} {m/mem_reg[0][1]/CDN} {m/mem_reg[0][1]/D} {m/mem_reg[0][1]/ENN} {m/mem_reg[0][2]/CDN} {m/mem_reg[0][2]/D} {m/mem_reg[0][2]/ENN} {m/mem_reg[0][3]/CDN} {m/mem_reg[0][3]/D} {m/mem_reg[0][3]/ENN} {m/mem_reg[0][4]/CDN} {m/mem_reg[0][4]/D} {m/mem_reg[0][4]/ENN} {m/mem_reg[0][5]/CDN} {m/mem_reg[0][5]/D} {m/mem_reg[0][5]/ENN} {m/mem_reg[0][6]/CDN} {m/mem_reg[0][6]/D} {m/mem_reg[0][6]/ENN} {m/mem_reg[0][7]/CDN} {m/mem_reg[0][7]/D} {m/mem_reg[0][7]/ENN} {m/mem_reg[1][0]/CDN} {m/mem_reg[1][0]/D} {m/mem_reg[1][0]/ENN} {m/mem_reg[1][1]/CDN} {m/mem_reg[1][1]/D} {m/mem_reg[1][1]/ENN} {m/mem_reg[1][2]/CDN} {m/mem_reg[1][2]/D} {m/mem_reg[1][2]/ENN} {m/mem_reg[1][3]/CDN} {m/mem_reg[1][3]/D} {m/mem_reg[1][3]/ENN} {m/mem_reg[1][4]/CDN} {m/mem_reg[1][4]/D} {m/mem_reg[1][4]/ENN} {m/mem_reg[1][5]/CDN} {m/mem_reg[1][5]/D} {m/mem_reg[1][5]/ENN} {m/mem_reg[1][6]/CDN} {m/mem_reg[1][6]/D} {m/mem_reg[1][6]/ENN} {m/mem_reg[1][7]/CDN} {m/mem_reg[1][7]/D} {m/mem_reg[1][7]/ENN} {m/mem_reg[2][0]/CDN} {m/mem_reg[2][0]/D} {m/mem_reg[2][0]/ENN} {m/mem_reg[2][1]/CDN} {m/mem_reg[2][1]/D} {m/mem_reg[2][1]/ENN} {m/mem_reg[2][2]/CDN} {m/mem_reg[2][2]/D} {m/mem_reg[2][2]/ENN} {m/mem_reg[2][3]/CDN} {m/mem_reg[2][3]/D} {m/mem_reg[2][3]/ENN} {m/mem_reg[2][4]/CDN} {m/mem_reg[2][4]/D} {m/mem_reg[2][4]/ENN} {m/mem_reg[2][5]/CDN} {m/mem_reg[2][5]/D} {m/mem_reg[2][5]/ENN} {m/mem_reg[2][6]/CDN} {m/mem_reg[2][6]/D} {m/mem_reg[2][6]/ENN} {m/mem_reg[2][7]/CDN} {m/mem_reg[2][7]/D} {m/mem_reg[2][7]/ENN} {m/mem_reg[3][0]/CDN} {m/mem_reg[3][0]/D} {m/mem_reg[3][0]/ENN} {m/mem_reg[3][1]/CDN} {m/mem_reg[3][1]/D} {m/mem_reg[3][1]/ENN} {m/mem_reg[3][2]/CDN} {m/mem_reg[3][2]/D} {m/mem_reg[3][2]/ENN} {m/mem_reg[3][3]/CDN} {m/mem_reg[3][3]/D} {m/mem_reg[3][3]/ENN} {m/mem_reg[3][4]/CDN} {m/mem_reg[3][4]/D} {m/mem_reg[3][4]/ENN} {m/mem_reg[3][5]/CDN} {m/mem_reg[3][5]/D} {m/mem_reg[3][5]/ENN} {m/mem_reg[3][6]/CDN} {m/mem_reg[3][6]/D} {m/mem_reg[3][6]/ENN} {m/mem_reg[3][7]/CDN} {m/mem_reg[3][7]/D} {m/mem_reg[3][7]/ENN} {m/mem_reg[4][0]/CDN} {m/mem_reg[4][0]/D} {m/mem_reg[4][0]/ENN} {m/mem_reg[4][1]/CDN} {m/mem_reg[4][1]/D} {m/mem_reg[4][1]/ENN} {m/mem_reg[4][2]/CDN} {m/mem_reg[4][2]/D} {m/mem_reg[4][2]/ENN} {m/mem_reg[4][3]/CDN} {m/mem_reg[4][3]/D} {m/mem_reg[4][3]/ENN} {m/mem_reg[4][4]/CDN} {m/mem_reg[4][4]/D} {m/mem_reg[4][4]/ENN} {m/mem_reg[4][5]/CDN} {m/mem_reg[4][5]/D} {m/mem_reg[4][5]/ENN} {m/mem_reg[4][6]/CDN} {m/mem_reg[4][6]/D} {m/mem_reg[4][6]/ENN} {m/mem_reg[4][7]/CDN} {m/mem_reg[4][7]/D} {m/mem_reg[4][7]/ENN} {m/mem_reg[5][0]/CDN} {m/mem_reg[5][0]/D} {m/mem_reg[5][0]/ENN} {m/mem_reg[5][1]/CDN} {m/mem_reg[5][1]/D} {m/mem_reg[5][1]/ENN} {m/mem_reg[5][2]/CDN} {m/mem_reg[5][2]/D} {m/mem_reg[5][2]/ENN} {m/mem_reg[5][3]/CDN} {m/mem_reg[5][3]/D} {m/mem_reg[5][3]/ENN} {m/mem_reg[5][4]/CDN} {m/mem_reg[5][4]/D} {m/mem_reg[5][4]/ENN} {m/mem_reg[5][5]/CDN} {m/mem_reg[5][5]/D} {m/mem_reg[5][5]/ENN} {m/mem_reg[5][6]/CDN} {m/mem_reg[5][6]/D} {m/mem_reg[5][6]/ENN} {m/mem_reg[5][7]/CDN} {m/mem_reg[5][7]/D} {m/mem_reg[5][7]/ENN} {m/mem_reg[6][0]/CDN} {m/mem_reg[6][0]/D} {m/mem_reg[6][0]/ENN} {m/mem_reg[6][1]/CDN} {m/mem_reg[6][1]/D} {m/mem_reg[6][1]/ENN} {m/mem_reg[6][2]/CDN} {m/mem_reg[6][2]/D} {m/mem_reg[6][2]/ENN} {m/mem_reg[6][3]/CDN} {m/mem_reg[6][3]/D} {m/mem_reg[6][3]/ENN} {m/mem_reg[6][4]/CDN} {m/mem_reg[6][4]/D} {m/mem_reg[6][4]/ENN} {m/mem_reg[6][5]/CDN} {m/mem_reg[6][5]/D} {m/mem_reg[6][5]/ENN} {m/mem_reg[6][6]/CDN} {m/mem_reg[6][6]/D} {m/mem_reg[6][6]/ENN} {m/mem_reg[6][7]/CDN} {m/mem_reg[6][7]/D} {m/mem_reg[6][7]/ENN} {m/mem_reg[7][0]/CDN} {m/mem_reg[7][0]/D} {m/mem_reg[7][0]/ENN} {m/mem_reg[7][1]/CDN} {m/mem_reg[7][1]/D} {m/mem_reg[7][1]/ENN} {m/mem_reg[7][2]/CDN} {m/mem_reg[7][2]/D} {m/mem_reg[7][2]/ENN} {m/mem_reg[7][3]/CDN} {m/mem_reg[7][3]/D} {m/mem_reg[7][3]/ENN} {m/mem_reg[7][4]/CDN} {m/mem_reg[7][4]/D} {m/mem_reg[7][4]/ENN} {m/mem_reg[7][5]/CDN} {m/mem_reg[7][5]/D} {m/mem_reg[7][5]/ENN} {m/mem_reg[7][6]/CDN} {m/mem_reg[7][6]/D} {m/mem_reg[7][6]/ENN} {m/mem_reg[7][7]/CDN} {m/mem_reg[7][7]/D} {m/mem_reg[7][7]/ENN} {m/mem_reg[8][0]/CDN} {m/mem_reg[8][0]/D} {m/mem_reg[8][0]/ENN} {m/mem_reg[8][1]/CDN} {m/mem_reg[8][1]/D} {m/mem_reg[8][1]/ENN} {m/mem_reg[8][2]/CDN} {m/mem_reg[8][2]/D} {m/mem_reg[8][2]/ENN} {m/mem_reg[8][3]/CDN} {m/mem_reg[8][3]/D} {m/mem_reg[8][3]/ENN} {m/mem_reg[8][4]/CDN} {m/mem_reg[8][4]/D} {m/mem_reg[8][4]/ENN} {m/mem_reg[8][5]/CDN} {m/mem_reg[8][5]/D} {m/mem_reg[8][5]/ENN} {m/mem_reg[8][6]/CDN} {m/mem_reg[8][6]/D} {m/mem_reg[8][6]/ENN} {m/mem_reg[8][7]/CDN} {m/mem_reg[8][7]/D} {m/mem_reg[8][7]/ENN} {m/mem_reg[9][0]/CDN} {m/mem_reg[9][0]/D} {m/mem_reg[9][0]/ENN} {m/mem_reg[9][1]/CDN} {m/mem_reg[9][1]/D} {m/mem_reg[9][1]/ENN} {m/mem_reg[9][2]/CDN} {m/mem_reg[9][2]/D} {m/mem_reg[9][2]/ENN} {m/mem_reg[9][3]/CDN} {m/mem_reg[9][3]/D} {m/mem_reg[9][3]/ENN} {m/mem_reg[9][4]/CDN} {m/mem_reg[9][4]/D} {m/mem_reg[9][4]/ENN} {m/mem_reg[9][5]/CDN} {m/mem_reg[9][5]/D} {m/mem_reg[9][5]/ENN} {m/mem_reg[9][6]/CDN} {m/mem_reg[9][6]/D} {m/mem_reg[9][6]/ENN} {m/mem_reg[9][7]/CDN} {m/mem_reg[9][7]/D} {m/mem_reg[9][7]/ENN} {m/mem_reg[10][0]/CDN} {m/mem_reg[10][0]/D} {m/mem_reg[10][0]/ENN} {m/mem_reg[10][1]/CDN} {m/mem_reg[10][1]/D} {m/mem_reg[10][1]/ENN} {m/mem_reg[10][2]/CDN} {m/mem_reg[10][2]/D} {m/mem_reg[10][2]/ENN} {m/mem_reg[10][3]/CDN} {m/mem_reg[10][3]/D} {m/mem_reg[10][3]/ENN} {m/mem_reg[10][4]/CDN} {m/mem_reg[10][4]/D} {m/mem_reg[10][4]/ENN} {m/mem_reg[10][5]/CDN} {m/mem_reg[10][5]/D} {m/mem_reg[10][5]/ENN} {m/mem_reg[10][6]/CDN} {m/mem_reg[10][6]/D} {m/mem_reg[10][6]/ENN} {m/mem_reg[10][7]/CDN} {m/mem_reg[10][7]/D} {m/mem_reg[10][7]/ENN} {m/mem_reg[11][0]/CDN} {m/mem_reg[11][0]/D} {m/mem_reg[11][0]/ENN} {m/mem_reg[11][1]/CDN} {m/mem_reg[11][1]/D} {m/mem_reg[11][1]/ENN} {m/mem_reg[11][2]/CDN} {m/mem_reg[11][2]/D} {m/mem_reg[11][2]/ENN} {m/mem_reg[11][3]/CDN} {m/mem_reg[11][3]/D} {m/mem_reg[11][3]/ENN} {m/mem_reg[11][4]/CDN} {m/mem_reg[11][4]/D} {m/mem_reg[11][4]/ENN} {m/mem_reg[11][5]/CDN} {m/mem_reg[11][5]/D} {m/mem_reg[11][5]/ENN} {m/mem_reg[11][6]/CDN} {m/mem_reg[11][6]/D} {m/mem_reg[11][6]/ENN} {m/mem_reg[11][7]/CDN} {m/mem_reg[11][7]/D} {m/mem_reg[11][7]/ENN} {m/mem_reg[12][0]/CDN} {m/mem_reg[12][0]/D} {m/mem_reg[12][0]/ENN} {m/mem_reg[12][1]/CDN} {m/mem_reg[12][1]/D} {m/mem_reg[12][1]/ENN} {m/mem_reg[12][2]/CDN} {m/mem_reg[12][2]/D} {m/mem_reg[12][2]/ENN} {m/mem_reg[12][3]/CDN} {m/mem_reg[12][3]/D} {m/mem_reg[12][3]/ENN} {m/mem_reg[12][4]/CDN} {m/mem_reg[12][4]/D} {m/mem_reg[12][4]/ENN} {m/mem_reg[12][5]/CDN} {m/mem_reg[12][5]/D} {m/mem_reg[12][5]/ENN} {m/mem_reg[12][6]/CDN} {m/mem_reg[12][6]/D} {m/mem_reg[12][6]/ENN} {m/mem_reg[12][7]/CDN} {m/mem_reg[12][7]/D} {m/mem_reg[12][7]/ENN} {m/mem_reg[13][0]/CDN} {m/mem_reg[13][0]/D} {m/mem_reg[13][0]/ENN} {m/mem_reg[13][1]/CDN} {m/mem_reg[13][1]/D} {m/mem_reg[13][1]/ENN}}]
append_to_collection __coll_3 [get_pins {{m/mem_reg[13][2]/CDN} {m/mem_reg[13][2]/D} {m/mem_reg[13][2]/ENN} {m/mem_reg[13][3]/CDN} {m/mem_reg[13][3]/D} {m/mem_reg[13][3]/ENN} {m/mem_reg[13][4]/CDN} {m/mem_reg[13][4]/D} {m/mem_reg[13][4]/ENN} {m/mem_reg[13][5]/CDN} {m/mem_reg[13][5]/D} {m/mem_reg[13][5]/ENN} {m/mem_reg[13][6]/CDN} {m/mem_reg[13][6]/D} {m/mem_reg[13][6]/ENN} {m/mem_reg[13][7]/CDN} {m/mem_reg[13][7]/D} {m/mem_reg[13][7]/ENN} {m/mem_reg[14][0]/CDN} {m/mem_reg[14][0]/D} {m/mem_reg[14][0]/ENN} {m/mem_reg[14][1]/CDN} {m/mem_reg[14][1]/D} {m/mem_reg[14][1]/ENN} {m/mem_reg[14][2]/CDN} {m/mem_reg[14][2]/D} {m/mem_reg[14][2]/ENN} {m/mem_reg[14][3]/CDN} {m/mem_reg[14][3]/D} {m/mem_reg[14][3]/ENN} {m/mem_reg[14][4]/CDN} {m/mem_reg[14][4]/D} {m/mem_reg[14][4]/ENN} {m/mem_reg[14][5]/CDN} {m/mem_reg[14][5]/D} {m/mem_reg[14][5]/ENN} {m/mem_reg[14][6]/CDN} {m/mem_reg[14][6]/D} {m/mem_reg[14][6]/ENN} {m/mem_reg[14][7]/CDN} {m/mem_reg[14][7]/D} {m/mem_reg[14][7]/ENN} {m/mem_reg[15][0]/CDN} {m/mem_reg[15][0]/D} {m/mem_reg[15][0]/ENN} {m/mem_reg[15][1]/CDN} {m/mem_reg[15][1]/D} {m/mem_reg[15][1]/ENN} {m/mem_reg[15][2]/CDN} {m/mem_reg[15][2]/D} {m/mem_reg[15][2]/ENN} {m/mem_reg[15][3]/CDN} {m/mem_reg[15][3]/D} {m/mem_reg[15][3]/ENN} {m/mem_reg[15][4]/CDN} {m/mem_reg[15][4]/D} {m/mem_reg[15][4]/ENN} {m/mem_reg[15][5]/CDN} {m/mem_reg[15][5]/D} {m/mem_reg[15][5]/ENN} {m/mem_reg[15][6]/CDN} {m/mem_reg[15][6]/D} {m/mem_reg[15][6]/ENN} {m/mem_reg[15][7]/CDN} {m/mem_reg[15][7]/D} {m/mem_reg[15][7]/ENN} {wr_addr_sync/dff_2/rd_data_reg[4]/CDN} {wr_addr_sync/dff_2/rd_data_reg[4]/D} {wr_addr_sync/dff_2/rd_data_reg[3]/CDN} {wr_addr_sync/dff_2/rd_data_reg[3]/D} {wr_addr_sync/dff_2/rd_data_reg[1]/CDN} {wr_addr_sync/dff_2/rd_data_reg[1]/D} {wr_addr_sync/dff_2/rd_data_reg[0]/CDN} {wr_addr_sync/dff_2/rd_data_reg[0]/D} {wr_addr_sync/dff_2/rd_data_reg[2]/CDN} {wr_addr_sync/dff_2/rd_data_reg[2]/D} {rd_addr_sync/dff_2/rd_data_reg[4]/CDN} {rd_addr_sync/dff_2/rd_data_reg[4]/D} {rd_addr_sync/dff_2/rd_data_reg[3]/CDN} {rd_addr_sync/dff_2/rd_data_reg[3]/D} {rd_addr_sync/dff_2/rd_data_reg[1]/CDN} {rd_addr_sync/dff_2/rd_data_reg[1]/D} {rd_addr_sync/dff_2/rd_data_reg[0]/CDN} {rd_addr_sync/dff_2/rd_data_reg[0]/D} {rd_addr_sync/dff_2/rd_data_reg[2]/CDN} {rd_addr_sync/dff_2/rd_data_reg[2]/D} {rd_addr_sync/dff_1/rd_data_reg[4]/CDN} {rd_addr_sync/dff_1/rd_data_reg[4]/D} {rd_addr_sync/dff_1/rd_data_reg[3]/CDN} {rd_addr_sync/dff_1/rd_data_reg[3]/D} {rd_addr_sync/dff_1/rd_data_reg[1]/CDN} {rd_addr_sync/dff_1/rd_data_reg[1]/D} {rd_addr_sync/dff_1/rd_data_reg[0]/CDN} {rd_addr_sync/dff_1/rd_data_reg[0]/D} {rd_addr_sync/dff_1/rd_data_reg[2]/CDN} {rd_addr_sync/dff_1/rd_data_reg[2]/D} {wr_addr_sync/dff_1/rd_data_reg[4]/CDN} {wr_addr_sync/dff_1/rd_data_reg[4]/D} {wr_addr_sync/dff_1/rd_data_reg[3]/CDN} {wr_addr_sync/dff_1/rd_data_reg[3]/D} {wr_addr_sync/dff_1/rd_data_reg[1]/CDN} {wr_addr_sync/dff_1/rd_data_reg[1]/D} {wr_addr_sync/dff_1/rd_data_reg[2]/CDN} {wr_addr_sync/dff_1/rd_data_reg[2]/D} {f/wr_addr_grey_reg[3]/CDN} {f/wr_addr_grey_reg[3]/D} {f/wr_addr_grey_reg[2]/CDN} {f/wr_addr_grey_reg[2]/D} {f/wr_addr_grey_reg[1]/CDN} {f/wr_addr_grey_reg[1]/D} {f/wr_addr_grey_reg[0]/CDN} {f/wr_addr_grey_reg[0]/D} {e/rd_addr_grey_reg[3]/CDN} {e/rd_addr_grey_reg[3]/D} {e/rd_addr_grey_reg[2]/CDN} {e/rd_addr_grey_reg[2]/D} {e/rd_addr_grey_reg[1]/CDN} {e/rd_addr_grey_reg[1]/D} {e/rd_addr_grey_reg[0]/CDN} {e/rd_addr_grey_reg[0]/D} {e/rd_addr_bin_r_reg[4]/CDN} {e/rd_addr_bin_r_reg[4]/D}}]
set_false_path  -from [get_ports {wr_rst_pad rd_rst_pad rd_en_pad wr_en_pad}]  -to $__coll_3  
set_false_path  -from [get_clocks {read_clk}] -to [get_clocks {wr_vir_clk_i write_clk}]
set_false_path  -from [get_clocks {write_clk}] -to [get_clocks {rd_vir_clk_i read_clk}]
